{
  "id": "systems-archetypes",
  "title": "Systems Archetypes",
  "content": "# Systems Archetypes\n\nSystems archetypes are recurring patterns of behavior in complex systems. These patterns represent the \"classic stories\" that repeat themselves across different contexts - from personal relationships to organizational dynamics to global challenges.\n\n## The Core Archetypes\n\n### 1. Limits to Growth\nA reinforcing growth loop eventually hits a constraint that slows or reverses the growth. Classic pattern: success creates the seeds of its own downfall.\n\n**Example**: A startup grows rapidly until it outgrows its infrastructure, leading to customer service problems that slow growth.\n\n### 2. Shifting the Burden\nQuick fixes are used to address symptoms while the underlying problem remains unaddressed. Over time, the capability to solve the real problem atrophies.\n\n**Example**: Using debt to fund operations instead of addressing fundamental business model issues.\n\n### 3. Tragedy of the Commons\nMultiple actors, each acting rationally in their own interest, collectively deplete or destroy a shared resource.\n\n**Example**: Overfishing, climate change, traffic congestion.\n\n### 4. Success to the Successful\nTwo or more competing groups vie for limited resources. The more successful one becomes, the more resources it gets, starving the other groups.\n\n**Example**: Wealthy schools attracting better teachers, making them more successful, attracting more funding.\n\n### 5. Fixes that Fail\nA quick fix temporarily alleviates a problem symptom, but creates unintended consequences that worsen the original problem.\n\n**Example**: Using pesticides to kill bugs, which kills natural predators, leading to larger bug populations.\n\n### 6. Growth and Underinvestment\nGrowth is pursued but the capacity needed to sustain growth is not adequately invested in, creating a ceiling that limits future growth.\n\n**Example**: A company growing sales but not investing in customer service infrastructure.\n\n### 7. Accidental Adversaries\nTwo partners, each pursuing their own goals, inadvertently undermine each other's success.\n\n**Example**: Sales and engineering teams with conflicting priorities and metrics.\n\n## Recognition Patterns\n\nEach archetype has characteristic warning signs:\n\n- **Recurring problems** that seem to \"solve themselves\" only to return\n- **Quick fixes** that work temporarily but require increasingly frequent application\n- **Blame patterns** where parties point fingers at each other\n- **Resource constraints** that seem to appear suddenly despite apparent abundance\n- **Success stories** that inexplicably turn into failures\n\n## Intervention Strategies\n\nThe key to addressing systems archetypes is identifying the underlying structure and finding **leverage points**:\n\n1. **Map the system** - Identify the reinforcing and balancing loops\n2. **Find the constraint** - What's the real limiting factor?\n3. **Address root causes** - Not just symptoms\n4. **Change the structure** - Modify incentives, information flows, or decision-making authority\n5. **Build capacity** - Invest in long-term capabilities, not just quick fixes\n\n## The Meta-Pattern\n\nAll systems archetypes share a common meta-pattern: they arise from the interaction of **structure** (rules, physical elements, information flows) and **purpose** (goals, incentives, metrics). When these are misaligned, archetypal behaviors emerge.\n\n**The deeper insight**: These patterns are not bugs in the system - they're features. They emerge naturally from the system's structure. To change the behavior, you must change the structure.\n\n## Related Concepts\n\n- [[systems-leverage]] - Where to intervene in a system\n- [[feedback-loops]] - The building blocks of archetypes\n- [[complex-adaptive-systems]] - The context where archetypes emerge\n- [[emergence]] - How simple rules create complex patterns",
  "excerpt": "Recurring patterns of behavior in complex systems - the classic stories that repeat across contexts from personal relationships to global challenges.",
  "created": "2025-08-10",
  "updated": "2025-08-10",
  "links": ["systems-leverage", "feedback-loops", "complex-adaptive-systems", "emergence"],
  "tags": ["systems-thinking", "patterns", "behavior", "archetypes"]
}